# Introducción a Pandas y DataFrames

## Importando Pandas

In [88]:
import pandas as pd

## Series en Pandas
### Crear una Serie

In [89]:
data = [10, 20, 30, 40]
series = pd.Series(data)
print("Serie:")
print(series)

type(data)

Serie:
0    10
1    20
2    30
3    40
dtype: int64

list

In [90]:
type(series)

pandas.core.series.Series

### Acceso a elementos de una Serie

In [91]:
series = pd.Series(data)
print(series)
print("Elemento en la posición 2:", series[3])

0    10
1    20
2    30
3    40
dtype: int64
Elemento en la posición 2: 40

### Ejercicio Práctico (Series):
1. Crea una Serie que contenga los nombres de 5 estudiantes.
2. Accede al tercer estudiante usando su índice.

In [92]:
nombres=['Ruben', 'Natalia', 'Francheska', 'Silvia', 'Gabriela']
s_names=pd.Series(nombres)

display(s_names)

0         Ruben
1       Natalia
2    Francheska
3        Silvia
4      Gabriela
dtype: object

In [93]:
print(s_names[2])

Francheska

## DataFrames en Pandas
### Crear un DataFrame

In [94]:
data = {
    'Nombre': ['Juan', 'Ana', 'Luis'],
    'Edad': [23, 21, 25],
    'Ciudad': ['Quito', 'Guayaquil', 'Cuenca']
}

df = pd.DataFrame(data)
print("DataFrame:")
display(df)

DataFrame:

  Nombre  Edad     Ciudad
0   Juan    23      Quito
1    Ana    21  Guayaquil
2   Luis    25     Cuenca

### Acceso a columnas

In [95]:
# Acceso por índice posicional
print("Primera fila usando iloc:")
print(df.iloc[0])

Primera fila usando iloc:
Nombre     Juan
Edad         23
Ciudad    Quito
Name: 0, dtype: object

In [96]:
print(df.iloc[0,2])

Quito

In [97]:
df.index = ['a', 'b', 'c']
display(df)

  Nombre  Edad     Ciudad
a   Juan    23      Quito
b    Ana    21  Guayaquil
c   Luis    25     Cuenca

In [98]:
print(df.loc['a':'b'])

  Nombre  Edad     Ciudad
a   Juan    23      Quito
b    Ana    21  Guayaquil

In [99]:
print(df.iloc[0:3,2])

a        Quito
b    Guayaquil
c       Cuenca
Name: Ciudad, dtype: object

In [100]:
print(df.loc[['a'], ['Ciudad']] )

  Ciudad
a  Quito

## Operaciones Básicas con DataFrames
### Añadir una nueva columna

In [101]:
df['Saludo'] = 'Hola ' + df['Nombre']
print("DataFrame con nueva columna:")
display(df)

DataFrame con nueva columna:

  Nombre  Edad     Ciudad     Saludo
a   Juan    23      Quito  Hola Juan
b    Ana    21  Guayaquil   Hola Ana
c   Luis    25     Cuenca  Hola Luis

### Filtrado de filas

In [102]:
# Filtrar personas mayores de 22 años
print("Filtrar filas donde Edad > 22:")

Filtrar filas donde Edad > 22:

In [103]:
display(df)

  Nombre  Edad     Ciudad     Saludo
a   Juan    23      Quito  Hola Juan
b    Ana    21  Guayaquil   Hola Ana
c   Luis    25     Cuenca  Hola Luis

In [104]:
df_1=df.copy() #Todo No olvidad sacar una copia de DF si se van a realizar cambios representativos 

df_1=df[df['Edad'] < 24]
display(df_1)

  Nombre  Edad     Ciudad     Saludo
a   Juan    23      Quito  Hola Juan
b    Ana    21  Guayaquil   Hola Ana

### Estadísticas descriptivas

In [105]:
print("Resumen estadístico:")
print(df.describe())

Resumen estadístico:
       Edad
count   3.0
mean   23.0
std     2.0
min    21.0
25%    22.0
50%    23.0
75%    24.0
max    25.0

In [106]:
df['Notas']=[7,10,5]
display(df)

  Nombre  Edad     Ciudad     Saludo  Notas
a   Juan    23      Quito  Hola Juan      7
b    Ana    21  Guayaquil   Hola Ana     10
c   Luis    25     Cuenca  Hola Luis      5

In [107]:
print(df.describe())

       Edad      Notas
count   3.0   3.000000
mean   23.0   7.333333
std     2.0   2.516611
min    21.0   5.000000
25%    22.0   6.000000
50%    23.0   7.000000
75%    24.0   8.500000
max    25.0  10.000000

### Ejercicio Práctico (Operaciones):
1. Agrega una nueva columna a un DataFrame que calcule un descuento de 10% sobre un precio inicial.
2. Filtra las filas donde la cantidad sea mayor que 10.
3. Calcula la media de los precios en el DataFrame.

In [116]:
data_2 = {
    'Marca': ['Iphone', 'Samsung', 'Haweii'],
    'Precio': [1000, 900, 500],
    'Cantidad': [15, 12, 6]
}
type(data_2)

dict

In [117]:
df_cell=pd.DataFrame(data_2)
display(df_cell)

     Marca  Precio  Cantidad
0   Iphone    1000        15
1  Samsung     900        12
2   Haweii     500         6

In [119]:
df_cell['Descuento 10%']=df_cell['Precio']*0.9
display(df_cell)

     Marca  Precio  Cantidad  Descuento 10%
0   Iphone    1000        15          900.0
1  Samsung     900        12          810.0
2   Haweii     500         6          450.0

In [120]:
display(df_cell[df_cell['Cantidad'] > 10])

     Marca  Precio  Cantidad  Descuento 10%
0   Iphone    1000        15          900.0
1  Samsung     900        12          810.0

In [123]:
print(f'La media es {df_cell['Precio'].mean()} $')

La media es 800.0 $


## Selección y Acceso Avanzado
### Selección con condiciones

In [108]:
print("Selección condicional:")
print(df[(df['Edad'] > 22) & (df['Ciudad'] == 'Quito')])

Selección condicional:
  Nombre  Edad Ciudad     Saludo  Notas
a   Juan    23  Quito  Hola Juan      7

### Acceso por índices y etiquetas

In [109]:
# Seleccionar una celda específica
print("Acceso a celda específica (iloc[0, 1]):")
print(df.iloc[0, 1])  # Fila 0, columna 1

Acceso a celda específica (iloc[0, 1]):
23

### Ejercicio Práctico (Selección):
1. Crea un DataFrame que represente las ventas de una tienda con columnas: producto, ventas, y ganancias.
2. Filtra los productos con ganancias mayores a 10000.
3. Selecciona las primeras 2 filas y las columnas "producto" y "ventas".

In [126]:
data_t = {
    "producto": [
        "Laptop", "Teléfono", "Tablet", "Audífonos", "Monitor",
        "Impresora", "Teclado", "Mouse", "Smartwatch", "Cámara"
    ],
    "ventas": [50, 120, 80, 200, 70, 40, 150, 170, 90, 60],
    "ganancias": [15000, 18000, 12000, 5000, 10500, 8000, 4500, 5100, 7200, 14000],
}

df_sell=pd.DataFrame(data_t)
display(df_sell)

     producto  ventas  ganancias
0      Laptop      50      15000
1    Teléfono     120      18000
2      Tablet      80      12000
3   Audífonos     200       5000
4     Monitor      70      10500
5   Impresora      40       8000
6     Teclado     150       4500
7       Mouse     170       5100
8  Smartwatch      90       7200
9      Cámara      60      14000

In [128]:
df_filtered=df_sell[df_sell['ganancias'] > 10000]
display(df_filtered)

   producto  ventas  ganancias
0    Laptop      50      15000
1  Teléfono     120      18000
2    Tablet      80      12000
4   Monitor      70      10500
9    Cámara      60      14000

In [132]:
df_x=df_sell.iloc[0:2,0:2]
display(df_x)

   producto  ventas
0    Laptop      50
1  Teléfono     120

## Guardar y Cargar Datos
### Guardar un DataFrame en un archivo CSV

In [133]:
df_sell.to_csv('ventas.csv', index=False)
print("DataFrame guardado como ventas.csv")

DataFrame guardado como ventas.csv

### Cargar un DataFrame desde un archivo CSV

In [134]:
df_loaded = pd.read_csv('ventas.csv')
print("DataFrame cargado desde 'ventas.csv':")
display(df_loaded)

DataFrame cargado desde 'dataframe.csv':

     producto  ventas  ganancias
0      Laptop      50      15000
1    Teléfono     120      18000
2      Tablet      80      12000
3   Audífonos     200       5000
4     Monitor      70      10500
5   Impresora      40       8000
6     Teclado     150       4500
7       Mouse     170       5100
8  Smartwatch      90       7200
9      Cámara      60      14000

In [136]:
print("Selección condicional:")
# print(df[(df['Edad'] > 22) & (df['Ciudad'] == 'Quito')])

df_double_f=df_sell[(df_sell['ganancias']>10000)&(df_sell['ventas']>50) ]
display(df_double_f)

Selección condicional:

   producto  ventas  ganancias
1  Teléfono     120      18000
2    Tablet      80      12000
4   Monitor      70      10500
9    Cámara      60      14000

### Ejercicio Práctico (Guardar y Cargar):
1. Guarda un DataFrame con datos ficticios en un archivo CSV.
2. Carga el archivo y muestra su contenido.

### Método de ordenamiento

In [139]:

# Crear un ejemplo de DataFrame
data = {
    'Nombre': ['Ana', 'Carlos', 'Beatriz', 'David'],
    'Edad': [29, 34, 23, 31],
    'Ciudad': ['Quito', 'Guayaquil', 'Cuenca', 'Ambato']
}
df = pd.DataFrame(data)

# Ordenar el DataFrame por la columna 'Edad'
df_ordenado = df.sort_values(by='Edad', ascending=False)

# Mostrar el DataFrame ordenado
print(df_ordenado)

    Nombre  Edad     Ciudad
1   Carlos    34  Guayaquil
3    David    31     Ambato
0      Ana    29      Quito
2  Beatriz    23     Cuenca

In [140]:
data_est = {
    'Estudiante': ['Ana', 'Carlos', 'Beatriz', 'David'],
    'Calificación': [6.5, 7.8, 5.9, 8.0]
}

In [142]:
df_est=pd.DataFrame(data_est)
display(df_est)

  Estudiante  Calificación
0        Ana           6.5
1     Carlos           7.8
2    Beatriz           5.9
3      David           8.0

In [145]:
df_est['Estado']=df_est['Calificación'].apply(lambda x: 'Aprueba' if x >= 7 else 'No aprueba')
display(df_est)

  Estudiante  Calificación      Estado
0        Ana           6.5  No aprueba
1     Carlos           7.8     Aprueba
2    Beatriz           5.9  No aprueba
3      David           8.0     Aprueba

In [146]:
df_est['GPA']=df_est['Calificación'].apply(lambda x: x*4/10)

In [147]:
display(df_est)

  Estudiante  Calificación      Estado   GPA
0        Ana           6.5  No aprueba  2.60
1     Carlos           7.8     Aprueba  3.12
2    Beatriz           5.9  No aprueba  2.36
3      David           8.0     Aprueba  3.20